In [1]:
#import panda dependency
import pandas as pd

In [2]:
#files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [3]:
#Read the school data file and store it in a panda dataframe
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [4]:
#read student data file and store it in panda dataframes
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
#determine if there are missing values in schoold data
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [6]:
#determine if there are missing values in student data
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [7]:
#determine if there are any missing values in school data
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [8]:
#determine if there are any missing values in student data
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [9]:
#determine not null for schools
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [10]:
#determine not null for students
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [ ]:
#4.5.3

In [14]:
#determine the data type for the column budget
school_data_df.budget.dtype

dtype('int64')

In [15]:
#determine the data type for the student data
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [23]:
#Clean the students names

#put the student names into a list
student_names = student_data_df["student_name"].tolist()

#creat a new list to hold the students names that have 3+ 'words'
students_to_fix = []

#use an if statement to add names to the list if they have 3+ words
for name in student_names:
    if len(name.split()) >=3:
        students_to_fix.append(name)


#create a list of the prefixes from those students that have 3+ names
#create an empty list to hold the prefixes
prefixes = []

#cycle through the names in the newly created list only and if the first element has more for or less letters, add it to the list
#only add the prefix to the list, not the whole name!
for name in students_to_fix:
    if len(name.split()[0]) <= 4:
        prefixes.append(name.split()[0])

#Do the same thing for suffix
#only look for where there are 3 letters because all the prefixes only have those
suffixes = []

for name in students_to_fix:
    if len(name.split()[-1]) <=3:
        suffixes.append(name.split()[-1])

In [25]:
#print the list of unique prefixes
print(set(prefixes))

{'Mark', 'Dale', 'Mrs.', 'Dana', 'Joe', 'Mary', 'Jodi', 'Dawn', 'Omar', 'Tony', 'Chad', 'Tara', 'Toni', 'Kim', 'Jose', 'Kyle', 'Gary', 'Erik', 'Amy', 'Kari', 'Sara', 'Tina', 'Emma', 'Carl', 'Troy', 'Luke', 'Cory', 'Gail', 'Mike', 'John', 'Anna', 'Jon', 'Miss', 'Anne', 'Noah', 'Lynn', 'Judy', 'Leah', 'Greg', 'Jill', 'Dr.', 'Ruth', 'Cody', 'Ms.', 'Kara', 'Mr.', 'Ryan', 'Marc', 'Lori', 'Todd', 'Lisa', 'Gina', 'Seth', 'Adam', 'Sean', 'Eric', 'Paul', 'Erin', 'Ian'}

In [26]:
#print the list of unique suffixes
print(set(suffixes))

{'DDS', 'IV', 'DVM', 'PhD', 'Cox', 'Kim', 'Lee', 'Roy', 'Day', 'II', 'Jr.', 'Li', 'V', 'MD', 'III'}

In [28]:
#hard code the prefixes and suffixes in based on the list
#add the spaces after the pre and before the suff
pre_suff = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [31]:
#clean the student data to remove the pre and suffix words
for word in pre_suff:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word, "")
    
student_data_df.head(10)

C:\Users\julia\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  This is separate from the ipykernel package so we can avoid doing imports until

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84